test/upward_seepage_new/mix_debug_vm/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    root            "";
    case            "";
    instance        "";
    local           "";
    class           dictionary;
    object          couplingProperties;
}

/* ---------------------------- sub-models & settings ---------------------------- */

modelType B;

couplingInterval 100;

expandedCellScale 5;

allowUseSubCFDTimeStep false;

globalForce mixGlobalForce;

minCoarseParticleRadius 0.01;

refineMeshSkin 1.2;

useGuoBBOEquation false;

useDDtVoidFraction true;

forceModels
(
  ArchimedesIB
  ShirgaonkarIB
  Archimedes
  mixDragForce
  mixVirtualMassForce
);

momCoupleModels
(
  implicitCouple
);

voidFractionModel mix;

locateModel engineMix;

dataExchangeModel twoWayMPI;

averagingModel dense;

turbulenceModelType turbulenceProperties;

/* ---------------------------- sub-model properties ------------------------- */

implicitCoupleProps
{
  velFieldName "U";
  granVelFieldName "Us";
  voidFractionFieldName "voidFraction";
}

"(globalForceProps|mixGlobalForceProps)"
{
  verbose true;
  GaussCoreEff 3;
  velFieldName "U";
  voidFractionFieldName "voidFraction";
  volumeFractionFieldName "volumeFraction";
  gravityFieldName "g";
}

ArchimedesIBProps
{
  verbose true;
}

ShirgaonkarIBProps
{
  useTorque true;
  verbose true;
}

ArchimedesProps
{
  treatForceExplicitInMomEquation false;
  treatForceBothCFDAndDEM true;
  treatDEMForceImplicit false;
  verbose true;
  interpolation false;
}

mixDragForceProps
{
  dragModelName "Gidaspow";
  treatForceExplicitInMomEquation false;
  treatForceBothCFDAndDEM true;
  treatDEMForceImplicit false;
  verbose true;
  interpolation false;
  scalarViscosity false;
  useGaussCoreFunctionRefined true;
}

mixVirtualMassForceProps
{
  treatForceBothCFDAndDEM true;
  verbose true;
  useGaussCoreFunctionRefined true;
}

twoWayMPIProps
{
  liggghtsPath "../DEM/in.run";
}

mixProps
{
  alphaMin 0.3;
  scaleUpVol 1.0;
  maxCellsNumPerCoarseParticle 10000000;
}

engineMixProps
{
  verbose true;
  treeSearch true;
  zSplit 8;
  xySplit 16;
}
